Tekla Open API Reference for Tekla Structures 2025
CrossSection Constructor
Overload List
Name | Description
CrossSection(String)
 Creates a new cross section point instance.
CrossSection(ProfileName)
 Creates a new cross section point instance.
Top
See Also
Reference
CrossSection Class
Tekla.Structures.Catalogs Namespace